# Написати програму для роботи з даними про людей.
# Програма повинна вміти завантажувати дані з файлу, зберігати у файл, вводити нові записи і шукати існуючі записи.

# Програма зберігає дані про людину,
#    ПІБ, дата народження, дата смерті (може бути відсутня) і стать. При цьому ПІБ вводиться 3 полями:
#    Ім'я (обов'язково), Прізвище та По-батькові можуть не вводитись.

# Дата народження та дата смерті може вводитись у форматі:
# 12.10.1980     11 10 2000      01/02/1995    3-9-2007

# Пошук може здійснюватися па імені, прізвищу та по батькові і видає всі варіанти,
# які підходять під рядок пошуку (це може бути ім'я або прізвище, або ім'я
# і прізвище, або лише частина імені тощо). Наприклад, є такі записи:
#    Євген Крут Михайлович, 12.10.1980, 11.10.2001, m
#    Євгенія, 12.10.1980, 12.10.2001, f
#    Дмитро Євгенович, 10.03.2000, m
#    При пошуку "євген", видаються такі дані:
#    Євген Крут Михайлович 20 років, чоловік. Народився 12.10.1980. Помер: 11.10.2001. (ВIДМIНКИ зробити)
#    Євгенія 21 рік, жінка. Народилася 12.10.1980. Вмерла: 12.10.2001.
#    Дмитро Євгенович 22 роки, чоловік. Народився 10.03.2000.
#
# Бажана структура програми:
# - в основній частині програми знаходиться вічний цикл з меню, що може вибрати оператор;
#     самі дані організовані у вигляді класу в іншому файлі, який імпортується у файл
#     основної частини програми, де створюється об'єкт відповідного класу перед заходом
#     у вічний цикл;
# - всі пункти меню основної частини програми викликають ті чи інші методи у створеного
#     об'єкта даних;
# - при бажанні можна у третьому файлі створити окремий клас Person який буде
#     імпортуватися у файл з даними. Саме у цьому класі відбуватиметься валідація
#     введених даних.
#
# - програма дозволяє ввести нові дані про людей;
# - проводити пошук за вже введеними даними;
# - правильно розраховувати кількість повних років людини на основі дати народження та дати
#   смерті або поточної дати;
# - дуже бажано, щоб дані можна було зберігати у файл та загружати із файлу.
# - Програма повинна вміти обчислювати вік людини (кількість повних років)
#   (Євген Крут Михайлович, 12.10.1980, 11.10.2001, m)
#
import datetime
import string


class Human:
    def __init__(self, pib, birth, gender, death):
        self.pib = pib
        self.birth = birth
        self.gender = gender
        self.death = death


def get_pib():
    pib = input("Введiть призвiще, iм'я та по-батьковi (не обов'язково) через пробiл: ")
    for i in pib:
        if i in string.digits:
            pib = pib.replace(i, '')
    pib = pib.title()
    print(pib)
    return pib

pibs = get_pib()

def get_gender():
    while True:
        gender = input("Введiть стать (Ч\Ж): >>> ").upper()
        if gender in 'ЧЖ':
            return gender

gnd = get_gender()

def get_birth():
    while True:
        birth = input('Введыть дату народження: рiк, мiсяць, день (через пробiл): >>> ').split()
        if ("".join(birth).isdigit() and 1900 <= int(birth[0]) <= now.year and 1 <= int(birth[1]) <= 12 and 1 <= int(birth[2]) <= 31):
            try:
                date = datetime.datetime(int(birth[0]), int(birth[1]), int(birth[2]))
                if now > date:
                    break
            except ValueError:
                print("Ввведіть коректно: ")
        else:
            print("Ввведіть коректно: ")
    return date

birth_str = get_birth().strftime("%Y-%m-%d")

def get_death():
    while True:
        death = input('''Введiть дату смерті (якщо така існує): рiк, мiсяць, день (через пробiл) 
        якщо ще рано, то натисніть "Q" : >>> ''').upper().split()
        try:
            if death == ['Q']:
                return "---"
            death_date = datetime.datetime(int(death[0]), int(death[1]), int(death[2]))
            death_date_2 = now - death_date
            if death_date_2.days < 0:
                print(f'Death ERROR! дата смертi через {abs(death_date_2.days)} днiв? Звiдки знаете ? ')
                continue
            return death_date
        except Exception:
            print('ERROR! Введiть коректно: >>>')

try:
    dth_str = get_death().strftime("%Y-%m-%d")
except AttributeError:
    dth_str = "----"
#  dth_str - змiнна дати семртi (клас datetime)

def age():
    pass

print('                         ---- Вiдомостi про користувачiв ---- ')
# pib = pibs
# gender = gnd
# birth = birth_str
# death = dth_str
# age = ''

now = datetime.datetime.now()

while True:
    enter = input('''Введiть свiй вибiр :
                        1 - Додати користувача (ПIБ, рiк народження, рiк смертi, стать)
                        2 - Пошук користувача
                        3 - Вийти з програми\n >>> ''')
    if enter == '1':
        get_pib()
        get_gender()
        get_birth()
        get_death()

    elif enter == '2':
        ...

    elif enter == '3':
        ...

    elif enter == '4':
        print("Бувай )")
        exit()
    else:
        print('Некоректне введення! спробуйте знову!')

# vasya = Human(pibs, birth_str, dth_str)
