# Написати програму для роботи з даними про людей.
# Програма повинна вміти завантажувати дані з файлу, зберігати у файл, вводити нові записи і шукати існуючі записи.

# Програма зберігає дані про людину,
#    ПІБ, дата народження, дата смерті (може бути відсутня) і стать. При цьому ПІБ вводиться 3 полями:
#    Ім'я (обов'язково), Прізвище та По-батькові можуть не вводитись.

# Дата народження та дата смерті може вводитись у форматі:
# 12.10.1980     11 10 2000      01/02/1995    3-9-2007

# Пошук може здійснюватися па імені, прізвищу та по батькові і видає всі варіанти,
# які підходять під рядок пошуку (це може бути ім'я або прізвище, або ім'я
# і прізвище, або лише частина імені тощо). Наприклад, є такі записи:
#    Євген Крут Михайлович, 12.10.1980, 11.10.2001, m
#    Євгенія, 12.10.1980, 12.10.2001, f
#    Дмитро Євгенович, 10.03.2000, m
#    При пошуку "євген", видаються такі дані:
#    Євген Крут Михайлович 20 років, чоловік. Народився 12.10.1980. Помер: 11.10.2001. (ВIДМIНКИ зробити)
#    Євгенія 21 рік, жінка. Народилася 12.10.1980. Вмерла: 12.10.2001.
#    Дмитро Євгенович 22 роки, чоловік. Народився 10.03.2000.
#
# Бажана структура програми:
# - в основній частині програми знаходиться вічний цикл з меню, що може вибрати оператор;
#     самі дані організовані у вигляді класу в іншому файлі, який імпортується у файл
#     основної частини програми, де створюється об'єкт відповідного класу перед заходом
#     у вічний цикл;
# - всі пункти меню основної частини програми викликають ті чи інші методи у створеного
#     об'єкта даних;
# - при бажанні можна у третьому файлі створити окремий клас Person який буде
#     імпортуватися у файл з даними. Саме у цьому класі відбуватиметься валідація
#     введених даних.
#
# - програма дозволяє ввести нові дані про людей;
# - проводити пошук за вже введеними даними;
# - правильно розраховувати кількість повних років людини на основі дати народження та дати
#   смерті або поточної дати;
# - дуже бажано, щоб дані можна було зберігати у файл та загружати із файлу.
# - Програма повинна вміти обчислювати вік людини (кількість повних років)
#   (Євген Крут Михайлович, 12.10.1980, 11.10.2001, m)
#
import calendar, datetime

class Human:
     def __init__(self, pib, birth, gender, death=None):
         self.pib = pib
         self.birth = birth
         self.gender = gender
         self.death = None

     def __str__(self):
         ...
#-------------------------------------------------------------------------

pib = ''
gender = ''
birth = []
death = []
age = ''

while True:
    print()
    break
    #   menu:    0 - новий користувач
    #                1 - pib
    #                2 - birth  (перевырка по числах (>31, datatime))
    #                3 - death
    #                4 - gender
    #            1 - пошук
    #                1 -  ввести шось
    #            2 - quit or again

#now = datetime.now()
# #print("{}.{}.{} ".format(now.day, now.month, now.year))
# d = datetime.date(1, 3, 5)
# print(d)
#
# current_time = datetime.datetime.now()
# print(current_time)
birth = input('Введыть рік, місяць та дату народження: (через пробіл)').split()
d = datetime.date(birth[0], birth[1], birth[2])
print(d)