# Написати програму для роботи з даними про людей.
# Програма повинна вміти завантажувати дані з файлу, зберігати у файл, вводити нові записи і шукати існуючі записи.

# Програма зберігає дані про людину,
#    ПІБ, дата народження, дата смерті (може бути відсутня) і стать. При цьому ПІБ вводиться 3 полями:
#    Ім'я (обов'язково), Прізвище та По-батькові можуть не вводитись.

# Дата народження та дата смерті може вводитись у форматі:
# 12.10.1980     11 10 2000      01/02/1995    3-9-2007

# Пошук може здійснюватися па імені, прізвищу та по батькові і видає всі варіанти,
# які підходять під рядок пошуку (це може бути ім'я або прізвище, або ім'я
# і прізвище, або лише частина імені тощо). Наприклад, є такі записи:
#    Євген Крут Михайлович, 12.10.1980, 11.10.2001, m
#    Євгенія, 12.10.1980, 12.10.2001, f
#    Дмитро Євгенович, 10.03.2000, m
#    При пошуку "євген", видаються такі дані:
#    Євген Крут Михайлович 20 років, чоловік. Народився 12.10.1980. Помер: 11.10.2001. (ВIДМIНКИ зробити)
#    Євгенія 21 рік, жінка. Народилася 12.10.1980. Вмерла: 12.10.2001.
#    Дмитро Євгенович 22 роки, чоловік. Народився 10.03.2000.
#
# Бажана структура програми:
# - в основній частині програми знаходиться вічний цикл з меню, що може вибрати оператор;
#     самі дані організовані у вигляді класу в іншому файлі, який імпортується у файл
#     основної частини програми, де створюється об'єкт відповідного класу перед заходом
#     у вічний цикл;
# - всі пункти меню основної частини програми викликають ті чи інші методи у створеного
#     об'єкта даних;
# - при бажанні можна у третьому файлі створити окремий клас Person який буде
#     імпортуватися у файл з даними. Саме у цьому класі відбуватиметься валідація
#     введених даних.
#
# - програма дозволяє ввести нові дані про людей;
# - проводити пошук за вже введеними даними;
# - правильно розраховувати кількість повних років людини на основі дати народження та дати
#   смерті або поточної дати;
# - дуже бажано, щоб дані можна було зберігати у файл та загружати із файлу.
# - Програма повинна вміти обчислювати вік людини (кількість повних років)
#   (Євген Крут Михайлович, 12.10.1980, 11.10.2001, m)
#

from diplom_funcs import *
from diplom_class import Users

print('                         ---- Вiдомостi про користувачiв ---- ')

while True:
    enter = input('''Введiть свiй вибiр :
                        1 - Додати користувача (ПIБ, рiк народження, рiк смертi, стать)
                        2 - Пошук користувача
                        3 - Вийти з програми\n >>> ''')
    if enter == '1':

        user = Users(get_pib(), get_gender(), get_birth().strftime("%Y-%m-%d"), get_dth())
        print('Внесенi данi: ')
        print(user.pib_)
        print(user.gender_)
        print(user.birth_)
        print(user.death_)
        f_string_user = "{:<25} | {:<15} | {:<15} | {:<15}".format(user.pib_, user.gender_, user.birth_, user.death_)
        while True:
            save_or_not = input("Чи зберегти дані до файлу ? вкажіть Т(так) / Н(ні) ? >>> ").upper()
            if save_or_not == 'Н':
                break
            elif save_or_not == 'Т':
                save_to_file(f_string_user)
                break
            else:
                print("Не коректно. (Т/Н)? >>>")

    elif enter == '2':
        file_name = input('Вкажіть файл: ? >>> ')
        el = input('Вкажіть фрагмент: ? >>> ')
        found(file_name, el)

    elif enter == '3':
        print("Бувай )")
        exit()
    else:
        print('Некоректне введення! спробуйте знову!')


