# Створити генератор геометричної прогресії.
# При заданні початку прогресії -2 та кроку прогресії -5, генератор видає таку послідовність:
# -2  10 -50  250 -1250  6250 ...

# При заданні початку прогресії 10 і кроку прогресії 3, генератор видає таку послідовність:
# 10  30  90  270  810  2430

...
def my(start, fin, step):
    while start < fin:
        yield start * step
        start *= step

for el in my(-2, 6250, -5):
    print(el)

print("*******************************************************8")

def my(start, fin, step):
    while start < fin:
        yield start * step
        start *= step

for el in my(10, 2430, 3):
    print(el)