# Написати програму яка складається з вічного циклу, що очікує введення числа або одне із значень:
# "вихід", "exit", "quit", "e" або "q" у будь-якому регістрі.
# При введенні одного з цих значень відбувається вихід із вічного циклу.
# При будь-якому іншому введенні викликається окрема функція, яка вміє розпізнавати введені числа.
# Сама функція нічого не роздруковує, вона повертає рядок типу:
# "Ви ввели негативне дробове число: -6.7" або "Ви ввели не коректне число: Erdf"
# Потім у циклі виводиться це повідомлення і цикл починається знову чекаючи наступного введення.
# Функція на вхід приймає рядок із введення з вічного циклу.
# Аналізує її виключно методом .isdigit() та іншими методами рядків,
# без доп.бібліотек і переводить рядок у число, якщо це можливо.
# Функція вміє розпізнавати негативні числа та десяткові дроби,
# а також розпізнає десяткові дроби як з точкою, так і з комою.
# Функція повертає рядок в якому описується яке число введено - негативне або позитивно,
# ціле або дробове і виводить його або повідомляє, що введено не коректне число.
  # *Додатково: правильно розпізнається десятковий дріб без першого нуля.
  #  Крім того функція вміє розпознавати нуль.

def func(x):
    symvol = []
    for i in "qewrtyuiop[]asdfghjkl;'zxcvbnm/цкенгшщзхїфівапрйуолджєячсмитьбю":
        if i in x.lower():
            x = x.replace(i, "")
            symvol.append(i)
            if x == "":
                print("В вашому рядку не має жодного числа")
                break
    print("Якщо у вашому рядку були лишні симовли,  вони видалені: ...  ", *symvol)

    if str(x).count(".") > 1 or str(x).count(",") > 1 or (str(x).count(".") >= 1 and str(x).count(",") >= 1):
        print("incorrect. декілька '.' або ',' ")

    elif "," in x or "." in x:
        x = x.replace(",", ".")
        if str(x)[0] == "-":
            print(f"Ви ввели число від'ємне дробове: {x}")
        else:
            print(f"Ви ввели число додатнє дробове: {x}")

    elif str(x) != "" and str(x)[0] == "0" and str(x)[1] != ".":
        print(f"Що ви мали наувазі з першим нулем ? можливо {str(x)[1:]} або {'0.' + str(x)[1:]} ? введіть коректно...")

    elif str(x) != "" and float(x) > 0 and float(x) % 1 == 0:
        print(f"Ваше число  - ціле  додатнє: {x}")
    elif str(x) != "" and float(x) < 0 and float(x) % 1 == 0:
        print(f"Ваше число  - ціле  від'ємне: {x}")

while True:
    my_enter = input("Введіть число  або  'e/q' для виходу з програми:  ").lower()
    if my_enter in ['q', 'e', 'й', 'у']:
        print("Buy")
        break
    func(my_enter)