# Ввести з клавіатури 4 рядки та зберегти їх у 4 різні змінні.
# Створити файл і записати в нього перші 2 рядки та закрити файл.
# Потім відкрити файл на редагування і дозаписати 2 рядки, що залишилися.
# У підсумку файл має бути 4 рядки, кожен з яких повинен починатися з нового рядка.

s_1 = input("Введіть перший рядок: ")
s_2 = input("Введіть другий рядок: ")
s_3 = input("Введіть третій рядок: ")
s_4 = input("Введіть четвеотий рядок: ")

file = open("my_file.txt", "w")
file.write(s_1 + "\n")
file.write(s_2 + "\n")
file.close()

file = open("my_file.txt", "a")
file.write(s_3 + "\n")
file.write(s_4)
file.close()
