
# Прочитати збережений json-файл з попереднього завдання та записати дані на диск у csv-файл,
# першим стовпцьом буде ID (6-ти значне число, котре у попередньому завданні було ключем)
# і додавши новий стовпець "телефон".
# Крім цього, необхідно для кожного запису додати значення нової комірки “телефон”.
# Значення має бути заповнене випадковими цифрами.
# Назви стовпців будуть наступні: ID, Ім'я, Вік, Телефон.
# При цьому значення для перших трьох комірок необхідно дістати з json-файлу для кожного запису,
# а значення нової комірки "Телефон" сформувати.
#
# *Додаткове завдання не обов'язкове до виконання.
# Формування значення комірки телефону має бути наступним:
# • не всі люди можуть мати номер телефону. Хто має номер телефону,
# а хто ні визначається автоматично випадковим чином.
# З ймовірністю 75% осіб має номер телефону, з ймовірністю 25% - ні;
# • є список можливих трьох перших цифр (операторів), Наприклад: \
#     ['095', '066', '098', '096', '050', '097']
#
# • при формуванні нового номера телефону перші 3 цифри вибираються
# випадковим чином зі списку можливих операторів,
# решта 7 цифр може бути будь-якими і формуються випадковим чином.
# Для виконання цього завдання необхідно розібратися з бібліотекою "random"

import csv, json, random

with open('my_first.json', 'r') as f:
    f_json = json.load(f)

l = [el for el in f_json.values()]
l2 = list(f_json.keys())
operator = ['095', '096', '097', '098', '099', '063']

l3, count = [], 0
for i in l:
    i.insert(0, l2[count])
    l3.append(i)
    count += 1

tel = (random.choice(operator) + str(random.randint(1111111, 9999999)))

with open('my_first.csv', 'w', newline='') as f:
    writer = csv.writer(f)
    writer.writerow(['ID', 'Name', 'Age', 'Telephone'])
    for row in l3:
        writer.writerow([*row,
            (random.choice(operator) + str(random.randint(1111111,9999999)))
             if random.randint(1, 4) != 1 else "no telephone"])

with open('my_first.csv') as f:
    print(f.read())