# Створити генератор геометричної прогресії.
# При заданні початку прогресії -2 та кроку прогресії -5, генератор видає таку послідовність:
# -2  10 -50  250 -1250  6250 ...

# При заданні початку прогресії 10 і кроку прогресії 3, генератор видає таку послідовність:
# 10  30  90  270  810  2430

...
def my(a):
    while a < 10000:
        yield a
        a *= -5


for el in my(-2):
    print(el)

#----------------------------------------------------------------------------------------------
print()
def my_2(i):
    while i < 10000:
        yield i
        i *= 3


for el in my_2(10):
    print(el)