# Створіть власний клас String на основі стандартного класу str.
# В ньому необхідно:
# • Розширити стандартний метод, відповідальний за додавання
# • Написати відсутній у класі str метод відповідальний за віднімання
# Принцип роботи в новому класі String:
# об('єкти типу String можна додавати як між собою, так і з будь-яким іншим типом, '
#    'який може бути приведений до типу рядка. "Під капотом", обидва операнди приводиться до типу рядків '
#    'та потім відбувається конкаткатенація. Результатом додавання буде новий об')єкт класу String. Приклади виконання:
#
class String(str):

    def __add__(self, other):
        return str(self) + str(other)

    def __sub__(self, other):
        if str(other) in str(self):
            return str(self).replace(str(other), '', 1)
        else:
            return self


s_1 = String(None)
s_2 = String(['d', 0, '', 9])
print(s_1 + s_2)
print()
s_3 = String('my_new_stringm')
s_4 = String('m')
print(s_3 - s_4)